cf_billing/Documents/бестИзменениеТемпературногоГрафикаОбъектов.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<Document>
		<Properties>
			<Name>бестИзменениеТемпературногоГрафикаОбъектов</Name>
			<Posting>Allow</Posting>
			<RegisterRecords>
				<xr:Item>InformationRegister.бестТемпературныеГрафикиДоговоровСЮридическимиЛицами</xr:Item>
			</RegisterRecords>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Организация</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Район</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.энргЗоныОтвественности</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПериодНачисления</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДатаФактическогоСобытия</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Ответственный</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Пользователи</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Комментарий</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>300</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>ОбъектыРасчета</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Флаг</Name>
							<Type>
								<v8:Type>xs:boolean</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ОбъектРасчета</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.бестОбъектыРасчета</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ТемпературныйГрафик</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.бестТемпературныеГрафикиДоговоровСЮридическимиЛицами</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ТемпературныйГрафикПредЗн</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.бестТемпературныеГрафикиДоговоровСЮридическимиЛицами</v8:Type>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Document>
</MetaDataObject>

cf_billing/InformationRegisters/бестТемпературныеГрафикиДоговоровСЮридическимиЛицами.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<InformationRegister>
		<Properties>
			<Name>бестТемпературныеГрафикиДоговоровСЮридическимиЛицами</Name>
			<InformationRegisterPeriodicity>RecorderPosition</InformationRegisterPeriodicity>
			<WriteMode>RecorderSubordinate</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>ТемпературныйГрафик</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.бестТемпературныеГрафикиДоговоровСЮридическимиЛицами</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Attribute>
				<Properties>
					<Name>ПериодНачисления</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПериодРегистрации</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>DateTime</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Dimension>
				<Properties>
					<Name>Организация</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Район</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.энргЗоныОтвественности</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ОбъектРасчета</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.бестОбъектыРасчета</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

cf_billing/Documents/бестИзменениеТемпературногоГрафикаОбъектов/Ext/ObjectModule.bsl
#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область ОбработчикиСобытий

Процедура ПередЗаписью(Отказ, РежимЗаписи, РежимПроведения)
	Если ОбменДанными.Загрузка Тогда
		Отказ = Истина;
	КонецЕсли;
	
	Ответственный 	= Пользователи.ТекущийПользователь();
		
КонецПроцедуры

Процедура ОбработкаПроведения(Отказ, РежимПроведения)
	
	Если ЗначениеЗаполнено(ДатаФактическогоСобытия) тогда
		Момент 			= Новый Граница(Новый МоментВремени(КонецДня(ДатаФактическогоСобытия),Ссылка), ВидГраницы.Исключая) ;
		СтрокаОтказа 	= "На дату фактического события";
	иначе
		Момент 			= Новый Граница(МоментВремени(), ВидГраницы.Исключая);
		СтрокаОтказа 	= "На дату операции";
	КонецЕсли;
	
	
	ПроведениеПоРегистрам();
	
КонецПроцедуры

Процедура ОбработкаПроверкиЗаполнения(Отказ, ПроверяемыеРеквизиты)
	Если Не ЗначениеЗаполнено(ОбъектыРасчета) тогда 
		Отказ = Истина;
		ОбщегоНазначенияКлиентСервер.СообщитьПользователю("ТЧ не может быть пустой");	
	Иначе 
		Для Каждого СтрокаТЧ из ОбъектыРасчета цикл
			Если НЕ ЗначениеЗаполнено(СтрокаТЧ.ТемпературныйГрафик) и НЕ ЗначениеЗаполнено(СтрокаТЧ.ОбъектРасчета) Тогда
				Отказ 		= Истина;
				ОбщегоНазначенияКлиентСервер.СообщитьПользователю("В строке " + СтрокаТЧ.НомерСтроки + " не заполнено поле ""Объект расчета""",ЭтотОбъект,"ОбъектыРасчета["+(СтрокаТЧ.НомерСтроки-1)+"].ОбъектРасчета");				
			КонецЕсли;
			
			Если СтрокаТЧ.ТемпературныйГрафикПредЗн = СтрокаТЧ.ТемпературныйГрафик Тогда 
				Отказ = Истина;
				ОбщегоНазначенияКлиентСервер.СообщитьПользователю("В строке " + СтрокаТЧ.НомерСтроки + " значение температурного графика не изменилось ",ЭтотОбъект,"ОбъектыРасчета["+(СтрокаТЧ.НомерСтроки-1)+"].ТемпературныйГрафик");				
			КонецЕсли;
		КонецЦикла;
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

Процедура ПроведениеПоРегистрам()
	
	ДанныеТемпГрафики			 	= ПолучитьТаблицуПроведения();
	
	бестПроведениеСерверНП.ВыполнитьДвиженияПоРезультатуЗапроса(ДанныеТемпГрафики,				Движения.бестТемпературныеГрафикиДоговоровСЮридическимиЛицами);
	Движения.бестТемпературныеГрафикиДоговоровСЮридическимиЛицами.Записывать = Истина;
	
КонецПроцедуры

Функция ПолучитьТаблицуПроведения()
	Запрос = Новый Запрос;
	Запрос.УстановитьПараметр("Ссылка",				Ссылка);
	Запрос.УстановитьПараметр("Организация",		Организация);
	Запрос.УстановитьПараметр("Район",				Район);
	Запрос.УстановитьПараметр("ПериодНачисления",	ПериодНачисления);
	Запрос.УстановитьПараметр("Период",				?(ЗначениеЗаполнено(ДатаФактическогоСобытия),КонецДня(ДатаФактическогоСобытия),Дата));
	Запрос.УстановитьПараметр("ПериодРегистрации",	Дата);	
	Запрос.Текст  = "ВЫБРАТЬ
	                |	&Организация КАК Организация,
	                |	&Район КАК Район,
	                |	&ПериодНачисления КАК ПериодНачисления,
	                |	&ПериодРегистрации КАК ПериодРегистрации,
	                |	бестИзменениеТемпературногоГрафикаОбъектовОбъектыРасчета.ОбъектРасчета КАК ОбъектРасчета,
	                |	бестИзменениеТемпературногоГрафикаОбъектовОбъектыРасчета.ТемпературныйГрафик КАК ТемпературныйГрафик,
	                |	&Период КАК Период
	                |ИЗ
	                |	Документ.бестИзменениеТемпературногоГрафикаОбъектов КАК бестИзменениеТемпературногоГрафикаОбъектов
	                |		ЛЕВОЕ СОЕДИНЕНИЕ Документ.бестИзменениеТемпературногоГрафикаОбъектов.ОбъектыРасчета КАК бестИзменениеТемпературногоГрафикаОбъектовОбъектыРасчета
	                |		ПО (бестИзменениеТемпературногоГрафикаОбъектовОбъектыРасчета.Ссылка = бестИзменениеТемпературногоГрафикаОбъектов.Ссылка)
	                |			И (бестИзменениеТемпературногоГрафикаОбъектовОбъектыРасчета.Флаг)
	                |ГДЕ
	                |	бестИзменениеТемпературногоГрафикаОбъектов.Ссылка = &Ссылка";
	Результат = Запрос.Выполнить();
	
	Возврат Результат;	
КонецФункции

#КонецОбласти

#Иначе
ВызватьИсключение НСтр("ru = 'Недопустимый вызов объекта на клиенте.';
						|en = 'Invalid object call on the client.'");
#КонецЕсли
